#### The issue is now fixed by the backend. Below is the config tried on the latest provider version: 1.0.15

```hcl-terraform
module "system_qos_example" {
  depends_on = [
    data.intersight_organization_organization.default_org
  ]
  source      = "../../modules/system_qos_policies"
  description = "System QoS Default Example."
  name        = "example"
  org_moid    = data.intersight_organization_organization.default_org.results.0.moid
  tags        = var.tags
  classes  = {
    Platinum = {
      state        = "Enabled"
      bandwidth_percent  = 22
      cos                = 5
      mtu                = 9216
      multicast_optimize = false
      packet_drop        = true
      weight             = 10
    }
    Gold = {
      state        = "Enabled"
      bandwidth_percent  = 20
      cos                = 4
      mtu                = 9216
      multicast_optimize = false
      packet_drop        = true
      weight             = 9
    }
    Silver = {
      state        = "Enabled"
      bandwidth_percent  = 18
      cos                = 2
      mtu                = 1500
      multicast_optimize = false
      packet_drop        = true
      weight             = 8
    }
    Bronze = {
      state        = "Disabled"
      bandwidth_percent  = 15
      cos                = 1
      mtu                = 9216
      multicast_optimize = false
      packet_drop        = true
      weight             = 7
    }
    "Best Effort" = {
      state        = "Enabled"
      bandwidth_percent  = 11
      cos                = 255
      mtu                = 9216
      multicast_optimize = false
      packet_drop        = true
      weight             = 5
    }
    FC = {
      state        = "Enabled"
      bandwidth_percent  = 14
      cos                = 3
      mtu                = 2240
      multicast_optimize = false
      packet_drop        = false
      weight             = 5
    }
  }
}
```

#### And here is the output on terraform apply:
```bash
# module.system_qos_example.intersight_fabric_system_qos_policy.classes will be created
  + resource "intersight_fabric_system_qos_policy" "classes" {
      + account_moid         = (known after apply)
      + ancestors            = (known after apply)
      + class_id             = "fabric.SystemQosPolicy"
      + classes              = [
          + {
              + additional_properties = ""
              + admin_state           = "Enabled"
              + bandwidth_percent     = 11
              + class_id              = "fabric.QosClass"
              + cos                   = 255
              + mtu                   = 9216
              + multicast_optimize    = false
              + name                  = "Best Effort"
              + object_type           = "fabric.QosClass"
              + packet_drop           = true
              + weight                = 5
            },
          + {
              + additional_properties = ""
              + admin_state           = "Disabled"
              + bandwidth_percent     = 15
              + class_id              = "fabric.QosClass"
              + cos                   = 1
              + mtu                   = 9216
              + multicast_optimize    = false
              + name                  = "Bronze"
              + object_type           = "fabric.QosClass"
              + packet_drop           = true
              + weight                = 7
            },
          + {
              + additional_properties = ""
              + admin_state           = "Enabled"
              + bandwidth_percent     = 14
              + class_id              = "fabric.QosClass"
              + cos                   = 3
              + mtu                   = 2240
              + multicast_optimize    = false
              + name                  = "FC"
              + object_type           = "fabric.QosClass"
              + packet_drop           = false
              + weight                = 5
            },
          + {
              + additional_properties = ""
              + admin_state           = "Enabled"
              + bandwidth_percent     = 20
              + class_id              = "fabric.QosClass"
              + cos                   = 4
              + mtu                   = 9216
              + multicast_optimize    = false
              + name                  = "Gold"
              + object_type           = "fabric.QosClass"
              + packet_drop           = true
              + weight                = 9
            },
          + {
              + additional_properties = ""
              + admin_state           = "Enabled"
              + bandwidth_percent     = 22
              + class_id              = "fabric.QosClass"
              + cos                   = 5
              + mtu                   = 9216
              + multicast_optimize    = false
              + name                  = "Platinum"
              + object_type           = "fabric.QosClass"
              + packet_drop           = true
              + weight                = 10
            },
          + {
              + additional_properties = ""
              + admin_state           = "Enabled"
              + bandwidth_percent     = 18
              + class_id              = "fabric.QosClass"
              + cos                   = 2
              + mtu                   = 1500
              + multicast_optimize    = false
              + name                  = "Silver"
              + object_type           = "fabric.QosClass"
              + packet_drop           = true
              + weight                = 8
            },
        ]
      + create_time          = (known after apply)
      + description          = "System QoS Default Example."
      + domain_group_moid    = (known after apply)
      + id                   = (known after apply)
      + mod_time             = (known after apply)
      + moid                 = (known after apply)
      + name                 = "example"
      + object_type          = "fabric.SystemQosPolicy"
      + organization         = [
          + {
              + additional_properties = null
              + class_id              = "mo.MoRef"
              + moid                  = "5daa09956972652d314fdac4"
              + object_type           = "organization.Organization"
              + selector              = null
            },
        ]
      + owners               = (known after apply)
      + parent               = (known after apply)
      + permission_resources = (known after apply)
      + profiles             = (known after apply)
      + shared_scope         = (known after apply)
      + tags                 = (known after apply)
      + version_context      = (known after apply)
    }

  # module.system_qos_example.intersight_fabric_system_qos_policy.system_qos will be created
  + resource "intersight_fabric_system_qos_policy" "system_qos" {
      + account_moid         = (known after apply)
      + ancestors            = (known after apply)
      + class_id             = "fabric.SystemQosPolicy"
      + classes              = (known after apply)
      + create_time          = (known after apply)
      + description          = "System QoS Default Example."
      + domain_group_moid    = (known after apply)
      + id                   = (known after apply)
      + mod_time             = (known after apply)
      + moid                 = (known after apply)
      + name                 = "example"
      + object_type          = "fabric.SystemQosPolicy"
      + organization         = [
          + {
              + additional_properties = null
              + class_id              = "mo.MoRef"
              + moid                  = "5daa09956972652d314fdac4"
              + object_type           = "organization.Organization"
              + selector              = null
            },
        ]
      + owners               = (known after apply)
      + parent               = (known after apply)
      + permission_resources = (known after apply)
      + profiles             = (known after apply)
      + shared_scope         = (known after apply)
      + tags                 = (known after apply)
      + version_context      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

If you are still facing any issue, please provide more details on the provider version and the tf module used.